""" 02. Обновление цен товаров

Дан список товаров с ценами.
Программа должна
- применить скидку к каждому товару
- и добавить в список элемент с новой ценой.
- В конце вывести таблицу с новой ценой.

Данные:
products = [["Laptop", 1200], ["Mouse", 25], ["Keyboard", 75], ["Monitor", 200]]
Пример вывода:
Введите скидку (в процентах): 17

Товар          Старая цена    Новая цена
Laptop            1200.00$       996.00$
Mouse               25.00$        20.75$
Keyboard            75.00$        62.25$
Monitor            200.00$       166.00$


02.1 *Задания со звёздочкой:
Вывести результат в таком формате

Товар          Старая цена    Новая цена
Laptop........     $1200.00      $996.00
Mouse.........       $25.00       $20.75
Keyboard......       $75.00       $62.25
Monitor.......      $200.00      $166.00
"""
products = [["Laptop", 1200], ["Mouse", 25], ["Keyboard", 75], ["Monitor", 200]]

discount = 17  # int(input("Введите скидку (в процентах): "))

header = ["Товар", "Старая цена", "Новая цена"]
header1 = ("""
+---------------+-------------+------------+
| {:^13} | {:^11} | {:^11}|
+---------------+-------------+------------+
""".format(*header))
print(header1, end="")

for good in products:
    good_name, old_price = [*good]  # Достаем из списка данные о товаре
    new_price = old_price * (100 - discount) / 100  # Расчет новой цены с учетом скидки
    old = "$%.2f" % old_price  # Подготовка значений новой и старой цен для вывода в формате "$цена"
    new = "$%.2f" % new_price

    print(f"| {good_name:13} | {old:>11} | {new:>10} |")  # вывод в строку данных по каждому товару

footer = "+---------------+-------------+------------+"
print(footer)
